In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [4]:
titanic = pd.read_csv('data/titanic.csv')

In [5]:
titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [6]:
titanic.PassengerId = titanic.PassengerId.astype('category')

In [7]:
titanic.describe().T

          count       mean        std   min      25%      50%   75%       max
Survived  891.0   0.383838   0.486592  0.00   0.0000   0.0000   1.0    1.0000
Pclass    891.0   2.308642   0.836071  1.00   2.0000   3.0000   3.0    3.0000
Age       714.0  29.699118  14.526497  0.42  20.1250  28.0000  38.0   80.0000
SibSp     891.0   0.523008   1.102743  0.00   0.0000   0.0000   1.0    8.0000
Parch     891.0   0.381594   0.806057  0.00   0.0000   0.0000   0.0    6.0000
Fare      891.0  32.204208  49.693429  0.00   7.9104  14.4542  31.0  512.3292

In [8]:
titanic.shape

(891, 12)

In [9]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [10]:
cat_cols = ['Survived', 'Pclass', 'Sex', 'SibSp', 'Parch', 'Embarked']

In [11]:
cat_cols

['Survived', 'Pclass', 'Sex', 'SibSp', 'Parch', 'Embarked']

In [12]:
for col in cat_cols:
    print(titanic[col].value_counts())
    print('.' * 100)
    print(titanic[col].value_counts(normalize=True) * 100)
    print('=' * 100)

Survived
0    549
1    342
Name: count, dtype: int64
....................................................................................................
Survived
0    61.616162
1    38.383838
Name: proportion, dtype: float64
====================================================================================================
Pclass
3    491
1    216
2    184
Name: count, dtype: int64
....................................................................................................
Pclass
3    55.106622
1    24.242424
2    20.650954
Name: proportion, dtype: float64
====================================================================================================
Sex
male      577
female    314
Name: count, dtype: int64
....................................................................................................
Sex
male      64.758698
female    35.241302
Name: proportion, dtype: float64
====================================================================================================
SibSp
0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: count, dtype: int64
....................................................................................................
SibSp
0    68.237935
1    23.456790
2     3.142536
4     2.020202
3     1.795735
8     0.785634
5     0.561167
Name: proportion, dtype: float64
====================================================================================================
Parch
0    678
1    118
2     80
5      5
3      5
4      4
6      1
Name: count, dtype: int64
....................................................................................................
Parch
0    76.094276
1    13.243547
2     8.978676
5     0.561167
3     0.561167
4     0.448934
6     0.112233
Name: proportion, dtype: float64
====================================================================================================
Embarked
S    644
C    168
Q     77
Name: count, dtype: int64
....................................................................................................
Embarked
S    72.440945
C    18.897638
Q     8.661417
Name: proportion, dtype: float64
====================================================================================================

In [13]:
titanic.isnull().sum().sort_values(ascending=False)

Cabin          687
Age            177
Embarked         2
PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
SibSp            0
Parch            0
Ticket           0
Fare             0
dtype: int64